lkolbly/cmsis-svd/data/TexasInstruments/LM3S9792.svd
        <register>
          <name>RXCSRH10</name>
          <description>USB Receive Control and Status Endpoint 10 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH10_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH10_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT10</name>
          <description>USB Receive Byte Count Endpoint 10</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT10_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE10</name>
          <description>USB Host Transmit Configure Type Endpoint 10</description>
          <addressOffset>0x000001AA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE10_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE10_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE10_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE10_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL10</name>
          <description>USB Host Transmit Interval Endpoint 10</description>
          <addressOffset>0x000001AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL10_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL10</name>
          <description>USB Host Transmit Interval Endpoint 10</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL10_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE10</name>
          <description>USB Host Configure Receive Type Endpoint 10</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE10_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE10_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE10_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE10_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL10</name>
          <description>USB Host Receive Polling Interval Endpoint 10</description>
          <addressOffset>0x000001AD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL10_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL10</name>
          <description>USB Host Receive Polling Interval Endpoint 10</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001AD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL10_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP11</name>
          <description>USB Maximum Transmit Data Endpoint 11</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP11_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL11</name>
          <description>USB Transmit Control and Status Endpoint 11 Low</description>
          <addressOffset>0x000001B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL11_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL11</name>
          <description>USB Transmit Control and Status Endpoint 11 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL11_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL11_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH11</name>
          <description>USB Transmit Control and Status Endpoint 11 High</description>
          <addressOffset>0x000001B3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH11_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH11_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP11</name>
          <description>USB Maximum Receive Data Endpoint 11</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP11_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL11</name>
          <description>USB Receive Control and Status Endpoint 11 Low</description>
          <addressOffset>0x000001B6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL11_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL11</name>
          <description>USB Receive Control and Status Endpoint 11 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001B6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL11_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL11_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH11</name>
          <description>USB Receive Control and Status Endpoint 11 High</description>
          <addressOffset>0x000001B7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH11_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH11</name>
          <description>USB Receive Control and Status Endpoint 11 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001B7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH11_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH11_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT11</name>
          <description>USB Receive Byte Count Endpoint 11</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT11_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE11</name>
          <description>USB Host Transmit Configure Type Endpoint 11</description>
          <addressOffset>0x000001BA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE11_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE11_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE11_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE11_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE11_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE11_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE11_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE11_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE11_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE11_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL11</name>
          <description>USB Host Transmit Interval Endpoint 11</description>
          <addressOffset>0x000001BB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL11_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL11</name>
          <description>USB Host Transmit Interval Endpoint 11</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001BB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL11_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
